Mkdocs Revamp (#47)
* mkdoc overhaul

* mkdoc overhaul
